Процедура ОтправкаУведомоенийВТелеграмм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УведомленияТелеграмБоту.Текст КАК Текст,
	               |	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КодСостояния = ОтправитьСообщение(Выборка.Текст); 
		Если КодСостояния = 200 Тогда
			УведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УведомлениеОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправитьСообщение(Текст)
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	TokenTelegramm = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); 
	Ресурс = "/bot" + TokenTelegramm + "/sendMessage";  
	
	Соединение = Новый HTTPСоединение("api.telegram.org",,,,,,ЗащищенноеСоединение); 
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
	IDГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	Сообщение = Новый Структура;
	Сообщение.Вставить("chat_id", IDГруппы);
	Сообщение.Вставить("text", Текст);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Сообщение);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Сообщить("Сообщение успешно отправлено!");
	Иначе
		ЗаписьЖурналаРегистрации("Ошибка отправки:", 
		УровеньЖурналаРегистрации.Ошибка,,Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли; 
	
	Возврат Ответ.КодСостояния;
	
КонецФункции
