#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Уведомление = Неопределено;
	
	Если ТекущийОбъект.ЭтоНовый() И Не ЗначениеЗаполнено(ТекущийОбъект.Номер) Тогда
		
        ТекущийОбъект.УстановитьНовыйНомер(); 
		Уведомление = СтрШаблон("Новое обслуживание клиента: Документ № %1, дата обслуживания: %2 в %3, специалистом %4", 
		ТекущийОбъект.Номер, Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"), Формат(Объект.ВремяНачалаРабот_План,  "ДЛФ=T"), Объект.Специалист);
		
	Иначе
		
		Выборка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект.Ссылка,"ДатаПроведенияРабот,ВремяНачалаРабот_План,Специалист");
		
		Если Выборка.ДатаПроведенияРабот <> Объект.ДатаПроведенияРабот Тогда 
			Уведомление = СтрШаблон("Измениласть дата с %1 на %2. ", 
			Формат(Выборка.ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"), Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		
		Если Выборка.ВремяНачалаРабот_План <> Объект.ВремяНачалаРабот_План Тогда 
			Уведомление = СтрШаблон("Время обслуживания клиента скорректировано с %1 на %2. ", 
			Формат(Выборка.ВремяНачалаРабот_План, "ДЛФ=T"), Формат(Объект.ВремяНачалаРабот_План,  "ДЛФ=T")) + Уведомление;
		КонецЕсли;
		
		Если Выборка.Специалист <> Объект.Специалист Тогда 
			Уведомление = СтрШаблон("Специалист изменен с %1 на %2. ", 
			Выборка.Специалист, Объект.Специалист) + Уведомление;
		КонецЕсли;
		
		Если Уведомление <> Неопределено Тогда
			Уведомление = СтрШаблон("По документу № %1 скоректированы условия обслуживания. ", Объект.Номер) + Уведомление;
		КонецЕсли;
	
	КонецЕсли; 
	
	Если Уведомление <> Неопределено Тогда
		ДобавлениеУведомленияВСправочник(Уведомление);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавлениеУведомленияВСправочник(Текст);
	
	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеУведомление.Текст = Текст;
	НовоеУведомление.Записать();
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти