#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодсчетКоличестваДнейОтпуска();
	УсловноеОформлениеСтрок();
	
КонецПроцедуры 

#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда) 
	
	АдресХранилища = ПоместитьДанныеНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресХранилища);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодсчетКоличестваДнейОтпуска()  
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	
	ОтпускСотрудника = Новый Соответствие;
	КоличествоДнейОтпуска = 0;
	// Считаем количество дней отпуска у каждого сотрудника
	Для Каждого Строка Из ТаблицаОтпусков Цикл 
		
		Повтор = ОтпускСотрудника.Получить(Строка.Сотрудник);
		
		Если Повтор = Неопределено Тогда
			КоличествоДнейОтпуска = (Строка.ДатаОкончания - Строка.ДатаНачала)/86400 + 1; 
			ОтпускСотрудника.Вставить(Строка.Сотрудник, КоличествоДнейОтпуска);
		Иначе
			НовоеКоличествоДнейОтпуска = КоличествоДнейОтпуска + (Строка.ДатаОкончания - Строка.ДатаНачала)/86400 + 1;
			ОтпускСотрудника.Вставить(Строка.Сотрудник, НовоеКоличествоДнейОтпуска); 
		КонецЕсли;
		
	КонецЦикла; 
	
	// Заполняем колонку КоличествоДней
	Для Каждого Сотрудник Из ОтпускСотрудника Цикл
		
		Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
			
			Если Строка.Сотрудник = Сотрудник.Ключ Тогда
				Строка.КоличествоДней = Сотрудник.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;  
	
КонецПроцедуры 

Процедура УсловноеОформлениеСтрок() 
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона",  Новый Цвет(204, 255, 204));
	ЭлементОформления.Использование = Истина;
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.КоличествоДней");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 28;
	ЭлементОтбора.Использование = Истина;
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников"); 
	
КонецПроцедуры


&НаСервере
Функция ПоместитьДанныеНаСервере()
	
	ДанныеДляДиаграммы = Объект.ОтпускаСотрудников.Выгрузить();
	
	Адрес = ПоместитьВоВременноеХранилище(ДанныеДляДиаграммы, УникальныйИдентификатор);
	Возврат Адрес; 
	
КонецФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент) 
	
	ПодсчетКоличестваДнейОтпуска();
	УсловноеОформлениеСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент) 
	
	ПодсчетКоличестваДнейОтпуска();
	УсловноеОформлениеСтрок(); 
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
#КонецОбласти


