#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьТЧСправочникаУведомления(Период) Экспорт
	
	Результат = Новый Структура;
	ДанныеТЧ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, 0) КАК Ссылка,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.Договор.Организация КАК Организация
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = РеализацияТоваровУслуг.Договор
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|	И МЕСЯЦ(ВКМ_ОбслуживаниеКлиента.Дата) = МЕСЯЦ(&Период)";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ДанныеСтрок = Новый Структура;
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			РеализацияУслуг = Выборка.Ссылка;
		Иначе
			РеализацияУслуг = СоздатьДокументыРеализации(Период, Выборка);
		КонецЕсли;
		
		ДанныеСтрок.Вставить("Договор", Выборка.Договор);
		ДанныеСтрок.Вставить("РеализацияУслуг", РеализацияУслуг);  
		
		ДанныеТЧ.Добавить(ДанныеСтрок);
		
	КонецЦикла;

	Возврат ДанныеТЧ;
	
КонецФункции 

Функция СоздатьДокументыРеализации(Параметры, Выборка) Экспорт 
	
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Дата = Параметры; 
	НовыйДокумент.Договор = Выборка.Договор;
	НовыйДокумент.Организация = Выборка.Организация;
	НовыйДокумент.Контрагент = Выборка.Клиент;
	НовыйДокумент.Ответственный = Выборка.Специалист;
	НовыйДокумент.Комментарий = "Сформирован автоматически";
	НовыйДокумент.Записать();
	Ссылка = НовыйДокумент.Ссылка;
	НовыйДокумент.ВыполнитьАвтозаполнение();
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти