
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресДанных") Тогда
		ДанныеИзХранилища = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
		Объект.ОтпускаСотрудников.Загрузить(ДанныеИзХранилища); 
		
		Если ТипЗнч(ДанныеИзХранилища) = Тип("ТаблицаЗначений") Тогда
			ЗаполнитьДиаграммуГанта(ДанныеИзХранилища);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьДиаграммуГанта(ТаблицаДанных)
	
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЛегенду = Ложь;
	ШкалаВремени = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ШкалаВремени.Формат = "ДФ=MMММ";
	
	Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
	
	Для Каждого Стр Из ТаблицаДанных Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Стр.Сотрудник);
		Точка.Текст = Стр.Сотрудник;
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
		Интервал.Текст = СтрШаблон("%1 - %2", Формат(Интервал.Начало, "ДФ=dd.MM"), Формат(Интервал.Конец, "ДФ=dd.MM"));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти