#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_ОтпускаСотрудников Приход
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	Для Каждого ТекСтрока Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекСтрока.ДатаНачала;
		Движение.Сотрудник = ТекСтрока.Сотрудник;
		Движение.КоличествоДнейОтпуска = (ТекСтрока.ДатаОкончания - ТекСтрока.ДатаНачала)/86400 + 1;
	КонецЦикла;  
	
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли