#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//ВКМ++, Установить видимость элементов формы
	ВидимостьЭлементовФормы();
	//ВКМ--
КонецПроцедуры

#КонецОбласти

//ВКМ++
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидимостьЭлементовФормы();		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Установить видимость элементов формы
&НаСервере
Процедура ВидимостьЭлементовФормы()
		
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Элементы.ВКМ_ДатаНачала.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончания.Видимость = Ложь;
		Элементы. ВКМ_АбоненсткаяПлата.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Ложь;
	Иначе
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
		Элементы. ВКМ_АбоненсткаяПлата.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры
//ВКМ--
#КонецОбласти
