
&НаСервере
Функция ВыплатыСотрудникПриИзмененииНаСервере(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаДолга
	              |ИЗ
	              |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	              |ГДЕ
	              |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаДолга;
	Иначе
		Возврат 0;
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ВыплатыСотрудникПриИзменении(Элемент) 
	
	СтрокаТЧ = Элементы.Выплаты.ТекущиеДанные;
	СтрокаТЧ.ДолгПредприятия = ВыплатыСотрудникПриИзмененииНаСервере(СтрокаТЧ.Сотрудник);
	
КонецПроцедуры
