#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.АбоненскоеОбслуживание.Очистить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	
    Объект.АбоненскоеОбслуживание.Очистить();

	ДлительнаяОперация = ВыполнитьФоновоеЗаданиеНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 2;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект); 
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ДанныеДляЗаполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
		Если ЗначениеЗаполнено(ДанныеДляЗаполнения) Тогда
			Для Каждого Данные Из ДанныеДляЗаполнения Цикл
				НоваяСтрока = Объект.АбоненскоеОбслуживание.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Данные);
			КонецЦикла;
		Иначе
			 ОбщегоНазначенияКлиент.СообщитьПользователю("Документы обслуживания в данный период не проводились.");
		КонецЕсли;  	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере()
	
	ВыполняемыйМетод = "Обработки.ВКМ_МассовоеСозданиеАктов.ЗаполнитьТЧСправочникаУведомления";
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ВыполняемыйМетод, Объект.Период);
	Возврат ФоновоеЗадание;
	
КонецФункции

#КонецОбласти
